lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_HUB75.cpp
  ※ 0番 SHIFTREG_ABC座標,無灯の転送期間はパネル１枚の高さに比例、それ以外の期間はパネル全体の幅に比例する

   色深度8を再現するために、同一ラインに輝度成分の異なるデータを8回を送る。
   後半の輝度x2,x4のデータに対しては点灯期間が長いため、x1点灯期間を複数設けることで輝度差を実現する。
   "データ無しx1点灯期間"で送信する内容はすべて同一で良いため、同じメモリ範囲を共有利用してメモリを節約している。
*/

    uint32_t TRANSFER_PERIOD_COUNT = TRANSFER_PERIOD_COUNT_332;
    uint32_t EXTEND_PERIOD_COUNT = EXTEND_PERIOD_COUNT_332;
    uint32_t TOTAL_PERIOD_COUNT = TOTAL_PERIOD_COUNT_332;
    auto dma_buf_idx_tbl = dma_buf_idx_tbl_332;
    if (_depth == color_depth_t::rgb565_2Byte)
    {
      TRANSFER_PERIOD_COUNT = TRANSFER_PERIOD_COUNT_565;
      EXTEND_PERIOD_COUNT = EXTEND_PERIOD_COUNT_565;
      TOTAL_PERIOD_COUNT = TOTAL_PERIOD_COUNT_565;
      dma_buf_idx_tbl = dma_buf_idx_tbl_565;
    }

    _dmadesc = (lldesc_t*)heap_alloc_dma(sizeof(lldesc_t) * TOTAL_PERIOD_COUNT * _dma_desc_set);
    if (_dmadesc == nullptr)
    {
      ESP_EARLY_LOGE("Bus_HUB75", "memory allocate error.");
      endTransaction();
      return;
    }

    uint32_t panel_width = _panel_width;

    // DMA用バッファメモリ確保。 無データ点灯期間1回分 + データ転送期間8回分 + SHIFTREG_ABC座標期間1回 の合計10回分を連続領域として確保する
    // 無データ点灯期間は合計5回あるが、同じ領域を使い回すためバッファは1回分でよい;

    size_t buf_bytes = (((TRANSFER_PERIOD_COUNT + 1) * panel_width) + (2 * _panel_height)) * sizeof(uint16_t);
    _dma_transfer_len = (((TRANSFER_PERIOD_COUNT + EXTEND_PERIOD_COUNT) * panel_width) + (2 * _panel_height));


    for (size_t i = 0; i < _dma_desc_set; i++) {
      _dma_buf[i] = (uint16_t*)heap_alloc_dma(buf_bytes);
      if (_dma_buf[i] == nullptr) {
        ESP_EARLY_LOGE("Bus_HUB75", "memory allocate error.");
        endTransaction();
        return;
      }
      // バッファ初期値として OE(消灯)で埋めておく
      memset(_dma_buf[i], _mask_oe, buf_bytes);

      for (int j = 0; j < TOTAL_PERIOD_COUNT; j++) {
        uint32_t idx = i * TOTAL_PERIOD_COUNT + j;
        size_t bufidx = dma_buf_idx_tbl[j] * panel_width;
        // SHIFTREG_ABCの期間のみデータ長をpanel_height * 2とする
        size_t buflen = ((j == 0) ? _panel_height << 1 : panel_width) * sizeof(uint16_t);
        _dmadesc[idx].buf = (volatile uint8_t*)&(_dma_buf[i][bufidx]);
        _dmadesc[idx].eof = j == (TOTAL_PERIOD_COUNT - 1); // 最後の転送期間のみEOFイベントを発生させる
        _dmadesc[idx].empty = (uint32_t)(&_dmadesc[(idx + 1) % (TOTAL_PERIOD_COUNT * _dma_desc_set)]);
        _dmadesc[idx].owner = 1;
        _dmadesc[idx].length = buflen;
        _dmadesc[idx].size = buflen;
      }
    }
    setBrightness(_brightness);

    {
      if (_depth == color_depth_t::rgb565_2Byte)
      {
        _pixel_tbl = (uint32_t*)heap_alloc_dma(64 * sizeof(uint32_t));
        if (_pixel_tbl == nullptr)
        {
          ESP_EARLY_LOGE("Bus_HUB75", "memory allocate error.");
          endTransaction();
          return;
        }
        for (size_t i = 0; i < 64; ++i)
        {
          uint_fast8_t v = ((i * 65) >> 4) + 1;
          v = (v * v) >> 8;
          if (v < i) { v = i; }
          else if (v > 255) { v = 255; }
          uint32_t value = 0;
          for (size_t shift = 0; shift < 8; ++shift)
          {
            uint32_t mask = (1 << shift);
            value |= (v & mask) << (shift * 2);
          }
          _pixel_tbl[i] = value;
        }
      }
      else
      { // for RGB332
        _pixel_tbl = (uint32_t*)heap_alloc_dma(256 * sizeof(uint32_t));
        if (_pixel_tbl == nullptr)
        {
          ESP_EARLY_LOGE("Bus_HUB75", "memory allocate error.");
          endTransaction();
          return;
        }
        for (size_t rgb332 = 0; rgb332 < 256; ++rgb332)
        {
          uint_fast16_t r = 1 + (((rgb332 & 0xE0u) * 0b01001u) >> 5);
          uint_fast16_t g = 1 + (((rgb332 & 0x1Cu) * 0b01001u) >> 2);
          uint_fast16_t b = 1 + (((rgb332 & 0x03u) * 0b10101u)     );
          r = (r * r + 31) >> 7;
          g = (g * g + 31) >> 7;
          b = (b * b + 31) >> 7;
          if (r > 31) { r = 31; }
          if (g > 31) { g = 31; }
          if (b > 31) { b = 31; }

          uint32_t value = 0;
          for (size_t shift = 0; shift < 5; ++shift)
          {
            uint32_t mask = (1 << shift);
            value |= (r & mask) << (shift * 5 + 0)
                  |  (g & mask) << (shift * 5 + 1)
                  |  (b & mask) << (shift * 5 + 2);
          }
          _pixel_tbl[rgb332] = value;
        }
      }
    }

    if (_cfg.initialize_mode == config_t::initialize_mode_t::initialize_fm6124)
    { // LEDドライバの輝度レジスタ設定
      fm6124_init(_cfg.fm6124_brightness);
    }

    auto idx_base = (_cfg.i2s_port == I2S_NUM_0) ? I2S0O_DATA_OUT8_IDX : I2S1O_DATA_OUT8_IDX;
    for (size_t i = 0; i < 14; ++i)
    {
      if (_cfg.pin_data[i] < 0) continue;

#if defined ( LGFX_IDF_V5 )
      esp_rom_gpio_pad_select_gpio(_cfg.pin_data[i]);
      esp_rom_gpio_connect_out_signal(_cfg.pin_data[i  ], idx_base + i, 0, 0);
#else
      gpio_pad_select_gpio(_cfg.pin_data[i]);
      gpio_matrix_out(_cfg.pin_data[i  ], idx_base + i, 0, 0);
#endif
    }

    idx_base = (_cfg.i2s_port == I2S_NUM_0) ? I2S0O_WS_OUT_IDX : I2S1O_WS_OUT_IDX;
#if defined ( LGFX_IDF_V5 )
    esp_rom_gpio_connect_out_signal(_cfg.pin_clk, idx_base, 1, 0); // clock Active-low
#else
    gpio_matrix_out(_cfg.pin_clk, idx_base, 1, 0); // clock Active-low
#endif

    auto i2s_dev = (i2s_dev_t*)_dev;
    i2s_dev->out_link.val = 0;
    i2s_dev->fifo_conf.val = _fifo_conf_dma;
    i2s_dev->sample_rate_conf.val = _sample_rate_conf_reg_direct;

    // 総転送データ量とリフレッシュレートに基づいて送信クロックを設定する
    uint32_t freq_write = (_dma_transfer_len * _panel_height * _cfg.refresh_rate) >> 1;
    i2s_dev->clkm_conf.val = getClockDivValue(freq_write);
    i2s_dev->conf.val = _conf_reg_reset;
    i2s_dev->out_link.val = I2S_OUTLINK_START | ((uint32_t)_dmadesc & I2S_OUTLINK_ADDR);

    i2s_dev->int_ena.val = 0;
    i2s_dev->int_clr.val = ~0u;
    i2s_dev->int_ena.out_eof = 1;

#if portNUM_PROCESSORS > 1
    if (((size_t)_cfg.task_pinned_core) < portNUM_PROCESSORS)
    {
      xTaskCreatePinnedToCore(dmaTask, "hub75dma", 4096, this, _cfg.task_priority, &_dmatask_handle, _cfg.task_pinned_core);
    }
    else
#endif
    {
      xTaskCreate(dmaTask, "hub75dma", 4096, this, _cfg.task_priority, &_dmatask_handle);
    }
  }

  void Bus_HUB75::endTransaction(void)
  {
    auto i2s_dev = (i2s_dev_t*)_dev;
    i2s_dev->int_ena.val = 0;
    i2s_dev->int_clr.val = ~0u;
    i2s_dev->out_link.stop = 1;
    i2s_dev->conf.val = _conf_reg_reset;
    i2s_dev->out_link.val = 0;

