lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_HUB75.cpp
    if (_dmatask_handle)
    {
      auto handle = _dmatask_handle;
      _dmatask_handle = nullptr;
      xTaskNotify(handle, 0, eNotifyAction::eSetValueWithOverwrite);
      xTaskNotify(handle, 0, eNotifyAction::eSetValueWithOverwrite);
      vTaskDelay(2);
    }

    if (_pixel_tbl)
    {
      heap_free(_pixel_tbl);
      _pixel_tbl = nullptr;
    }
    if (_dmadesc)
    {
      heap_free(_dmadesc);
      _dmadesc = nullptr;
    }
    for (size_t i = 0; i < _dma_desc_set; i++)
    {
      if (_dma_buf[i])
      {
        heap_free(_dma_buf[i]);
        _dma_buf[i] = nullptr;
      }
    }
  }

  void IRAM_ATTR Bus_HUB75::i2s_intr_handler_hub75(void *arg)
  {
    auto me = (Bus_HUB75*)arg;
    auto dev = getDev(me->_cfg.i2s_port);
    dev->int_clr.val = dev->int_st.val;

    auto desc = (lldesc_t*)dev->out_eof_des_addr;
    xTaskNotifyFromISR(me->_dmatask_handle, (uint32_t)desc->buf, eNotifyAction::eSetValueWithOverwrite, nullptr);
    portYIELD_FROM_ISR();
  }

  void Bus_HUB75::dmaTask(void *arg)
  {
    auto me = (Bus_HUB75*)arg;

    int intr_source = ETS_I2S0_INTR_SOURCE;
#if SOC_I2C_NUM > 1
    if (me->_cfg.i2s_port != I2S_NUM_0)
    {
      intr_source = ETS_I2S1_INTR_SOURCE;
    }
#endif

    intr_handle_t isr_handle = nullptr;

    if (esp_intr_alloc(intr_source, ESP_INTR_FLAG_LEVEL1 | ESP_INTR_FLAG_IRAM,
        i2s_intr_handler_hub75, me, &(isr_handle)) != ESP_OK) {
      ESP_EARLY_LOGE("Bus_HUB75","esp_intr_alloc failure ");
      return;
    }

    ESP_EARLY_LOGV("Bus_HUB75","esp_intr_alloc success ");

    auto dev = getDev(me->_cfg.i2s_port);
    dev->conf.val = _conf_reg_start;
    dev->int_clr.val = ~0u;

    if (me->_depth == color_depth_t::rgb565_2Byte)
    {
      me->dmaTask565();
    }
    else
    {
      me->dmaTask332();
    }
    esp_intr_free(isr_handle);
    
    vTaskDelete( nullptr );
  }

  struct asm_work_t
  {
    uint32_t* d32;            //  0
    uint32_t* s32h;           //  4
    uint32_t* s32l;           //  8
    uint32_t* pixel_tbl;      // 12
    uint32_t* mixdata;        // 16
    uint16_t* xe_tbl;         // 20
    uint32_t len32;           // 24
    uint32_t xe_idx;          // 28
    uint32_t xe;              // 32
    uint32_t mask3bit;        // 36
    uint32_t mix_value;       // 40
    uint32_t* _retaddr;       // 44 A0保管用
  };

  void __attribute__ ((noinline)) __noinline asmHub75Draw332(asm_work_t* work)
  {
/* 関数が呼び出された直後のレジスタの値
    a0 : リターンアドレス (workに退避し、a0を別の用途に使用)
    a1 : スタックポインタ (変更不可)
    a2 : asm_work_t*      (変更せずそのまま利用する)
*/
    __asm__ __volatile__ (
      "s32i.n  a0,  a2,  44               \n" // A0 を退避
      "l32i.n  a3,  a2,  32               \n" // a3  = xe
      "l32i.n  a0,  a2,  0                \n" // ★a0  = 出力先アドレス
      "l32i.n  a15, a2,  16               \n" // ★a15 = mixdata アドレス
      "l32i.n  a14, a2,  24               \n" // ★a14 = len32
      "l32i.n  a13, a2,  12               \n" // ★a13 = pixel_tbl
      "l32i.n  a12, a2,  8                \n" // ★a12 = パネル下側の元データ配列
      "l32i.n  a11, a2,  4                \n" // ★a11 = パネル上側の元データ配列
      "l32i.n  a10, a15, 16               \n" // ★a10 に mixdata末尾の値を代入 (4*sizeof(uint32_t) = 16)
      "slli    a14, a14, 2                \n" // len32 を 4倍(d32の加算に使うため)

"HUB75_DRAW332_LOOP_START:          \n"

      "loop    a3, HUB75_DRAW332_LOOP_END \n" // ループ開始 (a3 にループ回数 xe がセットされた状態でここに来ること)

      "l8ui    a3,  a11, 0                \n" // a3 = 元データ上側配列から rgb332形式 1ピクセル目取得
      "l8ui    a5,  a11, 1                \n" // a5 = 元データ上側配列から rgb332形式 2ピクセル目取得
      "addi.n  a11, a11, 2                \n" // 元データのアドレスを2進める
      "l8ui    a4,  a12, 0                \n" // a4 = 元データ下側配列から rgb332形式 1ピクセル目取得
      "l8ui    a6,  a12, 1                \n" // a6 = 元データ下側配列から rgb332形式 2ピクセル目取得
      "addi.n  a12, a12, 2                \n" // 元データのアドレスを2進める

      "addx4   a3,  a3,  a13              \n" // a3  = テーブルアドレスに変換
      "l32i.n  a3,  a3,  0                \n" // a3  = pixel_tbl[RGB332] 1ピクセル目 上側の RGB成分 完成
      "addx4   a4,  a4,  a13              \n" // a4  = テーブルアドレスに変換
      "l32i.n  a4,  a4,  0                \n" // a4  = pixel_tbl[RGB332] 1ピクセル目 下側の RGB成分 完成
      "addx4   a5,  a5,  a13              \n" // a5  = テーブルアドレスに変換
      "l32i.n  a5,  a5,  0                \n" // a5  = pixel_tbl[RGB332] 1ピクセル目 上側の RGB成分 完成
      "addx4   a6,  a6,  a13              \n" // a6  = テーブルアドレスに変換
      "l32i.n  a6,  a6,  0                \n" // a6  = pixel_tbl[RGB332] 1ピクセル目 下側の RGB成分 完成

//////////////////

// この時点で a3,a4,a5,a6 に 合計4ピクセル分のデータが入った状態になっている
// ここから、パネル上側と下側のRGB成分が隣接し6bit単位となった状態に変換する

      "addx8   a3,  a4,  a3               \n"  // a3 = (lower_1 << 3) + upper_1
      "addx8   a4,  a6,  a5               \n"  // a4 = (lower_2 << 3) + upper_2

      "mov.n   a5,  a0                    \n"  // a5 に 出力先 アドレスをコピー
      "addi.n  a0,  a0,  4                \n"  // ★a0 出力先アドレス を1進める

      "s32i.n  a10, a5,  0                \n"  // mixdata 末尾のデータを出力先にセット

// ここから出力
// RGB成分 と mixdata(Y座標情報) を合わせた16bitデータを2ピクセル分32bit纏めて出力 を 5回(TRANSFER_PERIOD_COUNT) 行う

      "l32i.n   a8,  a15, 0               \n"  // a8  = mixdata[0]
      "extui    a7,  a3,  0,   6          \n"  // 1ピクセル目 6ビット取得
      "add.n    a5,  a14, a5              \n"  // a5 出力先アドレス += len32
      "slli     a7,  a7,  16              \n"  // 1ピクセル目のデータを左16bitシフト
      "add.n    a8,  a7,  a8              \n"  // a8 = 1ピクセル目+mixdata
      "extui    a7,  a4,  0,   6          \n"  // 2ピクセル目 6ビット取得
      "add.n    a7,  a7,  a8              \n"  // a7 = 2ピクセル目+a8
      "s32i.n   a7,  a5,  0               \n"  // a7 の値を出力先にセット

      "l32i.n   a8,  a15, 4               \n"  // a8 = mixdata[1]
      "extui    a7,  a3,  6,   6          \n"  // 1ピクセル目 6ビット取得
      "add.n    a5,  a14, a5              \n"  // a5 出力先アドレス += len32
      "slli     a7,  a7,  16              \n"  // 1ピクセル目のデータを左16bitシフト
      "add.n    a8,  a7,  a8              \n"  // a8 = 1ピクセル目+mixdata
      "extui    a7,  a4,  6,   6          \n"  // 2ピクセル目 6ビット取得
      "add.n    a7,  a7,  a8              \n"  // a7 = 2ピクセル目+a8
      "s32i.n   a7,  a5,  0               \n"  // a7 の値を出力先にセット

      "l32i.n   a8,  a15, 8               \n"  // a8  = mixdata[2]
      "extui    a7,  a3,  12,  6          \n"  // 1ピクセル目 6ビット取得
      "add.n    a5,  a14, a5              \n"  // a5 出力先アドレス += len32
      "slli     a7,  a7,  16              \n"  // 1ピクセル目のデータを左16bitシフト
      "add.n    a8,  a7,  a8              \n"  // a8 = 1ピクセル目+mixdata
      "extui    a7,  a4,  12,  6          \n"  // 2ピクセル目 6ビット取得
      "add.n    a7,  a7,  a8              \n"  // a7 = 2ピクセル目+a8
      "s32i.n   a7,  a5,  0               \n"  // a7 の値を出力先にセット

