lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_HUB75.cpp
//*
  void Bus_HUB75::dmaTask332(void)
  {
    const auto panel_width = _panel_width;
    const auto panel_height = _panel_height;
    const uint32_t len32 = panel_width >> 1;
    uint_fast8_t y = 0;

    const uint16_t* xe_tbl = _brightness_period;

    asm_work_t work;

    uint32_t yys[TRANSFER_PERIOD_COUNT_332 + 1];
    work.xe_tbl = _brightness_period;
    work.len32 = panel_width >> 1;
    work.pixel_tbl = _pixel_tbl;
    work.mixdata = yys;

    while (_dmatask_handle)
    {
// DEBUG
// lgfx::gpio_lo(15);
      auto dst = (uint32_t*)ulTaskNotifyTake( pdTRUE, portMAX_DELAY);
// DEBUG
// lgfx::gpio_hi(15);
      if (dst == nullptr) { break; }
      auto d32 = &dst[len32 * (TRANSFER_PERIOD_COUNT_332 + 1)];

      y = (y + 1) & ((panel_height>>1) - 1);

      {
      // SHIFTREG_ABCのY座標情報をセット;
        uint32_t poi = (~y) & ((panel_height >> 1) - 1);
        d32[poi                      ] = _mask_pin_a_clk | _mask_oe | _mask_pin_c_dat;
        d32[poi + (panel_height >> 1)] = _mask_pin_a_clk | _mask_oe | _mask_pin_c_dat;
        for (int i = 0; i < _dma_desc_set; ++i)
        { // 以前のY座標ビットを消去;
          poi = (poi + 1) & ((panel_height >> 1) - 1);
          d32[poi                      ] = _mask_pin_a_clk | _mask_oe;
          d32[poi + (panel_height >> 1)] = _mask_pin_a_clk | _mask_oe;
        }
        // 末尾にラッチを追加
        d32[panel_height - 1] |= _mask_lat | _mask_pin_b_lat;
      }

      uint32_t yy = 0;
      uint32_t yy_oe = _mask_oe | _mask_pin_b_lat; // PIN B Discharge
      if (_cfg.address_mode == config_t::address_mode_t::address_binary)
      {
        yy = y << 8 | y << 24;
        yy_oe = yy | _mask_oe;
      }
      yys[0] = yy_oe;
      for (size_t i = 1; i <= TRANSFER_PERIOD_COUNT_332; ++i)
      {
        yys[i] = yy;
      }

      work.d32 = dst;
      work.s32h = (uint32_t*)(_frame_buffer->getLineBuffer(y));
      work.s32l = (uint32_t*)(_frame_buffer->getLineBuffer(y + (panel_height>>1)));
      work.xe = xe_tbl[0] >> 1;
      work.xe_idx = 0;
      work.mix_value = yy_oe;

      // データ生成用の関数をコール
      asmHub75Draw332(&work);

      d32 = &dst[len32];

      // 無データ,点灯のみの期間の先頭の点灯防止処理
      d32[0 - len32] |= _mask_oe;
      d32[1 - len32] |= (xe_tbl[TRANSFER_PERIOD_COUNT_332 - 1] & 1) ? (_mask_oe & ~0xFFFF) : _mask_oe;

      d32 += len32;
      // データのラッチ及びラッチ直後の点灯防止処理
      for (int i = 0; i < TRANSFER_PERIOD_COUNT_332; ++i)
      {
        d32[len32 * i - 1] |= _mask_lat;
        d32[len32 * i + 0] |= _mask_oe;
        d32[len32 * i + 1] |= (xe_tbl[i] & 1) ? (_mask_oe & ~0xFFFF) :  _mask_oe;
      }

      // 作画中に次の割込みが発生した場合はビジー状態が続くことを回避するため処理をスキップする
      ulTaskNotifyTake( pdTRUE, 0);
    }
  }

  void Bus_HUB75::dmaTask565(void)
  {
    const auto panel_width = _panel_width;
    const auto panel_height = _panel_height;
    const uint32_t len32 = panel_width >> 1;
    uint_fast8_t y = 0;

    const uint16_t* xe_tbl = _brightness_period;

    asm_work_t work;

    uint32_t yys[TRANSFER_PERIOD_COUNT_565 + 1];
    work.xe_tbl = _brightness_period;
    work.len32 = panel_width >> 1;
    work.pixel_tbl = _pixel_tbl;
    work.mixdata = yys;

    while (_dmatask_handle)
    {
// DEBUG
// lgfx::gpio_lo(15);
      auto dst = (uint32_t*)ulTaskNotifyTake( pdTRUE, portMAX_DELAY);
// DEBUG
// lgfx::gpio_hi(15);
      if (dst == nullptr) { break; }
      auto d32 = &dst[len32 * (TRANSFER_PERIOD_COUNT_565 + 1)];

      y = (y + 1) & ((panel_height>>1) - 1);

      {
      // SHIFTREG_ABCのY座標情報をセット;
        uint32_t poi = (~y) & ((panel_height >> 1) - 1);
        d32[poi                      ] = _mask_pin_a_clk | _mask_oe | _mask_pin_c_dat;
        d32[poi + (panel_height >> 1)] = _mask_pin_a_clk | _mask_oe | _mask_pin_c_dat;
        for (int i = 0; i < _dma_desc_set; ++i)
        { // 以前のY座標ビットを消去;
          poi = (poi + 1) & ((panel_height >> 1) - 1);
          d32[poi                      ] = _mask_pin_a_clk | _mask_oe;
          d32[poi + (panel_height >> 1)] = _mask_pin_a_clk | _mask_oe;
        }
        // 末尾にラッチを追加
        d32[panel_height - 1] |= _mask_lat | _mask_pin_b_lat;
      }

      uint32_t yy = 0;
      uint32_t yy_oe = _mask_oe | _mask_pin_b_lat; // PIN B Discharge
      if (_cfg.address_mode == config_t::address_mode_t::address_binary)
      {
        yy = y << 8 | y << 24;
        yy_oe = yy | _mask_oe;
      }
      yys[0] = yy_oe;
      for (size_t i = 1; i <= TRANSFER_PERIOD_COUNT_565; ++i)
      {
        yys[i] = yy;
      }

      work.d32 = dst;
      work.s32h = (uint32_t*)(_frame_buffer->getLineBuffer(y));
      work.s32l = (uint32_t*)(_frame_buffer->getLineBuffer(y + (panel_height>>1)));
      work.xe = xe_tbl[0] >> 1;
      work.xe_idx = 0;
      work.mix_value = yy_oe;

      // データ生成用の関数をコール
      asmHub75Draw565(&work);

      d32 = &dst[len32];

      // 無データ,点灯のみの期間の先頭の点灯防止処理
      d32[0 - len32] |= _mask_oe;
      d32[1 - len32] |= (xe_tbl[TRANSFER_PERIOD_COUNT_565 - 1] & 1) ? (_mask_oe & ~0xFFFF) : _mask_oe;

      d32 += len32;
      // データのラッチ及びラッチ直後の点灯防止処理
      for (int i = 0; i < TRANSFER_PERIOD_COUNT_565; ++i)
      {
        d32[len32 * i - 1] |= _mask_lat;
        d32[len32 * i + 0] |= _mask_oe;
        d32[len32 * i + 1] |= (xe_tbl[i] & 1) ? (_mask_oe & ~0xFFFF) :  _mask_oe;
      }

      // 作画中に次の割込みが発生した場合はビジー状態が続くことを回避するため処理をスキップする
      ulTaskNotifyTake( pdTRUE, 0);
    }
  }
/*/
 // C++版 dmaTask332
  void Bus_HUB75::dmaTask332(void)
  {
    const auto panel_width = _panel_width;
    const auto panel_height = _panel_height;
    const uint32_t len32 = panel_width >> 1;
    uint_fast8_t y = 0;

    const uint16_t* xe_tbl = _brightness_period;
    auto pixel_tbl = _pixel_tbl;

    while (_dmatask_handle)
    {
// DEBUG
// lgfx::gpio_lo(15);
      auto dst = (uint32_t*)ulTaskNotifyTake( pdTRUE, portMAX_DELAY);
// DEBUG
// lgfx::gpio_hi(15);
      if (dst == nullptr) { break; }
      auto d32 = dst;

      y = (y + 1) & ((panel_height>>1) - 1);

      uint32_t yy = 0;
      uint32_t yy_oe = _mask_oe | _mask_pin_b_lat;
      if (_cfg.address_mode == config_t::address_mode_t::address_binary)
      {
        yy = y << 8 | y << 24;
        yy_oe = yy | _mask_oe;
      }
      uint32_t yys[] = { yy_oe, yy, yy, yy, yy, yy, yy, yy, yy, };

