lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_HUB75.cpp
      auto s_upper = (uint16_t*)(_frame_buffer->getLineBuffer(y));
      auto s_lower = (uint16_t*)(_frame_buffer->getLineBuffer(y + (panel_height>>1)));

      uint_fast8_t xe_idx = 0;
      uint32_t x = 0;
      uint32_t xe = xe_tbl[0] >> 1;
// lgfx::gpio_lo(15);
      for (;;)
      {
        do
        {
          // RGB332の値を基にガンマテーブルを適用する
          // このテーブルの中身は単にガンマ補正をするだけでなく、
          // BGR順に1ビットずつ並んだ状態に変換する処理を兼ねている。
          uint32_t rgb_upper_1 = *s_upper++;
          uint32_t rgb_lower_1 = *s_lower++;
          uint32_t rgb_upper_2 = rgb_upper_1 >> 8;
          uint32_t rgb_lower_2 = rgb_lower_1 >> 8;

          rgb_upper_1 &= 0xFF;
          rgb_lower_1 &= 0xFF;

          rgb_upper_1 = pixel_tbl[rgb_upper_1];
          rgb_lower_1 = pixel_tbl[rgb_lower_1];
          rgb_upper_2 = pixel_tbl[rgb_upper_2];
          rgb_lower_2 = pixel_tbl[rgb_lower_2];

          // パラレルで同時に送信する6bit分のRGB成分(画面の上半分と下半分)が隣接するように纏める。
          uint32_t rgb_1 = rgb_upper_1 + (rgb_lower_1 << 3);
          uint32_t rgb_2 = rgb_upper_2 + (rgb_lower_2 << 3);

          d32[len32 * 0] = yys[TRANSFER_PERIOD_COUNT_332];

          int32_t i = 0;
          uint32_t pixel_2 = rgb_2 & 0x3F;
          uint32_t pixel_1 = rgb_1 & 0x3F;
          pixel_2 += yys[i];
          pixel_1 <<= 16;
          d32[++i * len32] = pixel_1 + pixel_2;
          do
          {
            rgb_2 >>= 6;
            rgb_1 >>= 6;
            pixel_2 = rgb_2 & 0x3F;
            pixel_1 = rgb_1 & 0x3F;
            pixel_2 += yys[i];
            pixel_1 <<= 16;
            // 横２列ぶん同時にバッファにセットする
            d32[++i * len32] = pixel_1 + pixel_2;
          } while (i < TRANSFER_PERIOD_COUNT_332);

          ++d32;
        } while (++x < xe);
        if (xe_idx == TRANSFER_PERIOD_COUNT_332) break;
        do {
          yys[++xe_idx] = yy_oe;
          xe = xe_tbl[xe_idx] >> 1;
        } while (x >= xe);
      }
// lgfx::gpio_hi(15);

      // 無データ,点灯のみの期間の先頭の点灯防止処理
      d32[0 - len32] |= _mask_oe;
      d32[1 - len32] |= (xe_tbl[TRANSFER_PERIOD_COUNT_332-1] & 1) ? (_mask_oe & ~0xFFFF) : _mask_oe;

      d32 += len32;
      // データのラッチ及びラッチ直後の点灯防止処理
      for (int i = 0; i < TRANSFER_PERIOD_COUNT_332; ++i)
      {
        d32[len32 * i - 1] |= _mask_lat;
        d32[len32 * i + 0] |= _mask_oe;
        d32[len32 * i + 1] |= (xe_tbl[i] & 1) ? (_mask_oe & ~0xFFFF) :  _mask_oe;
      }

      d32 += len32 * (TRANSFER_PERIOD_COUNT_332 - 1);

      {
      // SHIFTREG_ABCのY座標情報をセット;
        uint32_t poi = (~y) & ((panel_height >> 1) - 1);
        d32[poi                      ] = _mask_pin_a_clk | _mask_oe | _mask_pin_c_dat;
        d32[poi + (panel_height >> 1)] = _mask_pin_a_clk | _mask_oe | _mask_pin_c_dat;
        for (int i = 0; i < _dma_desc_set; ++i)
        {
          poi = (poi + 1) & ((panel_height >> 1) - 1);
          d32[poi                      ] = _mask_pin_a_clk | _mask_oe;
          d32[poi + (panel_height >> 1)] = _mask_pin_a_clk | _mask_oe;
        }
        d32[panel_height - 1] |= _mask_lat | _mask_pin_b_lat;
      }

      // 作画中に次の割込みが発生した場合はビジー状態が続くことを回避するため処理をスキップする
      ulTaskNotifyTake( pdTRUE, 0);
    }
  }

 // C++版 dmaTask565
  void Bus_HUB75::dmaTask565(void)
  {
    const auto panel_width = _panel_width;
    const auto panel_height = _panel_height;
    const uint32_t len32 = panel_width >> 1;
    uint_fast8_t y = 0;

    const uint16_t* xe_tbl = _brightness_period;
    auto pixel_tbl = _pixel_tbl;

    while (_dmatask_handle)
    {
// DEBUG
lgfx::gpio_lo(15);
      auto dst = (uint32_t* __restrict)ulTaskNotifyTake( pdTRUE, portMAX_DELAY);
// DEBUG
lgfx::gpio_hi(15);
      if (dst == nullptr) { break; }
      auto d32 = dst;

      y = (y + 1) & ((panel_height>>1) - 1);

      uint32_t yy = 0;
      uint32_t yy_oe = _mask_oe | _mask_pin_b_lat; // PIN B Discharge
      if (_cfg.address_mode == config_t::address_mode_t::address_binary)
      {
        yy = y << 8 | y << 24;
        yy_oe = yy | _mask_oe;
      }
      uint32_t yys[] = { yy_oe, yy, yy, yy, yy, yy, yy, yy, yy, };

      auto s_upper = (uint32_t* __restrict)(_frame_buffer->getLineBuffer(y));
      auto s_lower = (uint32_t* __restrict)(_frame_buffer->getLineBuffer(y + (panel_height>>1)));

      uint_fast8_t xe_idx = 0;
      uint32_t x = 0;
      uint32_t xe = xe_tbl[0] >> 1;
// lgfx::gpio_lo(15);
      for (;;)
      {
        do
        {
          // 16bit RGB565を32bit変数に2ピクセル纏めて取り込む。(画面の上半分用)
          uint32_t rgb565x2_upper = *s_upper++;
          // 画面の下半分用のピクセルも同様に2ピクセル纏めて取り込む
          uint32_t rgb565x2_lower = *s_lower++;

          // R,G,Bそれぞれの成分に分離する。2x2=4ピクセルまとめて処理することで演算回数を削減する
          uint32_t r_upper_1 = rgb565x2_upper >> 11;
          uint32_t r_lower_1 = rgb565x2_lower >> 11;
          uint32_t g_upper_1 = rgb565x2_upper >> 5;
          uint32_t g_lower_1 = rgb565x2_lower >> 5;
          uint32_t b_upper_2 = rgb565x2_upper & 0x1F001F;
          uint32_t b_lower_2 = rgb565x2_lower & 0x1F001F;
          uint32_t r_upper_2 = r_upper_1 & 0x1F001F;
          uint32_t r_lower_2 = r_lower_1 & 0x1F001F;
          uint32_t g_upper_2 = g_upper_1 & 0x3F003F;
          uint32_t g_lower_2 = g_lower_1 & 0x3F003F;

          r_upper_1 = r_upper_2 & 0x1F;
          r_lower_1 = r_lower_2 & 0x1F;
          r_upper_2 >>= 16;
          r_lower_2 >>= 16;
          g_upper_1 = g_upper_2 & 0x3F;
          g_lower_1 = g_lower_2 & 0x3F;
          g_upper_2 >>= 16;
          g_lower_2 >>= 16;
          uint32_t b_upper_1 = b_upper_2 & 0x1F;
          uint32_t b_lower_1 = b_lower_2 & 0x1F;
          b_upper_2 >>= 16;
          b_lower_2 >>= 16;

          // RGBそれぞれ64階調値を元にガンマテーブルを適用する
          // このテーブルの中身は単にガンマ補正をするだけでなく、
          // 各ビットを3bit間隔に変換する処理を兼ねている。
          // 具体的には  0bABCDEFGH  ->  0bA__B__C__D__E__F__G__H__ のようになる
          r_upper_1 = pixel_tbl[r_upper_1 << 1];
          r_lower_1 = pixel_tbl[r_lower_1 << 1];
          r_upper_2 = pixel_tbl[r_upper_2 << 1];
          r_lower_2 = pixel_tbl[r_lower_2 << 1];
          g_upper_1 = pixel_tbl[g_upper_1];
          g_lower_1 = pixel_tbl[g_lower_1];
          g_upper_2 = pixel_tbl[g_upper_2];
          g_lower_2 = pixel_tbl[g_lower_2];
          b_upper_1 = pixel_tbl[b_upper_1 << 1];
          b_lower_1 = pixel_tbl[b_lower_1 << 1];
          b_upper_2 = pixel_tbl[b_upper_2 << 1];
          b_lower_2 = pixel_tbl[b_lower_2 << 1];

