lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_HUB75.cpp
          // テーブルから取り込んだ値は3bit間隔となっているので、
          // R,G,Bそれぞれが互いを避けるようにビットシフトすることでまとめることができる。
          g_upper_1 += b_upper_1 << 1;
          g_lower_1 += b_lower_1 << 1;
          g_upper_2 += b_upper_2 << 1;
          g_lower_2 += b_lower_2 << 1;
          uint32_t rgb_upper_1 = r_upper_1 + (g_upper_1 << 1);
          uint32_t rgb_lower_1 = r_lower_1 + (g_lower_1 << 1);
          uint32_t rgb_upper_2 = r_upper_2 + (g_upper_2 << 1);
          uint32_t rgb_lower_2 = r_lower_2 + (g_lower_2 << 1);

          // 上記の変数の中身は BGRBGRBGRBGR… の順にビットが並んだ状態となる
          // これを、各色の0,2,4,6ビットと1,3,5,7ビットの成分に分離する
          uint32_t rgb_upper_1_even = rgb_upper_1 & 0b00111000111000111000111000111000;
          uint32_t rgb_upper_1_odd  = rgb_upper_1 & 0b11000111000111000111000111000111;
          uint32_t rgb_lower_1_even = rgb_lower_1 & 0b00111000111000111000111000111000;
          uint32_t rgb_lower_1_odd  = rgb_lower_1 & 0b11000111000111000111000111000111;
          uint32_t rgb_upper_2_even = rgb_upper_2 & 0b00111000111000111000111000111000;
          uint32_t rgb_upper_2_odd  = rgb_upper_2 & 0b11000111000111000111000111000111;
          uint32_t rgb_lower_2_even = rgb_lower_2 & 0b00111000111000111000111000111000;
          uint32_t rgb_lower_2_odd  = rgb_lower_2 & 0b11000111000111000111000111000111;

          // パラレルで同時に送信する6bit分のRGB成分(画面の上半分と下半分)が隣接するように纏める。
          uint32_t rgb_even_1 = (rgb_lower_1_even    ) + (rgb_upper_1_even >> 3);
          uint32_t rgb_odd_1  = (rgb_lower_1_odd << 3) + (rgb_upper_1_odd      );
          uint32_t rgb_even_2 = (rgb_lower_2_even    ) + (rgb_upper_2_even >> 3);
          uint32_t rgb_odd_2  = (rgb_lower_2_odd << 3) + (rgb_upper_2_odd      );

          d32[0] = yys[TRANSFER_PERIOD_COUNT - 1];

          uint32_t i = 0;
          do
          {
            uint32_t odd_2 = rgb_odd_2 & 0x3F;
            uint32_t odd_1 = rgb_odd_1 & 0x3F;
            uint32_t even_2 = rgb_even_2 & 0x3F;
            uint32_t even_1 = rgb_even_1 & 0x3F;
            rgb_odd_2 >>= 6;
            rgb_odd_1 >>= 6;
            odd_2 += yys[i] + (odd_1 << 16);
            // 奇数番ビット成分を横２列ぶん同時にバッファにセットする
            d32[++i * len32] = odd_2;
            even_2 += yys[i] + (even_1 << 16);
            rgb_even_2 >>= 6;
            rgb_even_1 >>= 6;
            // 偶数番ビット成分を横２列ぶん同時にバッファにセットする
            d32[++i * len32] = even_2;
          } while (i < TRANSFER_PERIOD_COUNT);
          ++d32;
        } while (++x < xe);
        if (xe_idx >= TRANSFER_PERIOD_COUNT) break;
        do {
          yys[++xe_idx] = yy_oe;
          xe = xe_tbl[xe_idx] >> 1;
        } while (x >= xe);
      }
// lgfx::gpio_hi(15);

      // 無データ,点灯のみの期間の先頭の点灯防止処理
      d32[0 - len32] |= _mask_oe;
      d32[1 - len32] |= (xe_tbl[TRANSFER_PERIOD_COUNT-1] & 1) ? (_mask_oe & ~0xFFFF) : _mask_oe;

      d32 += len32;
      // データのラッチ及びラッチ直後の点灯防止処理
      for (int i = 0; i < TRANSFER_PERIOD_COUNT; ++i)
      {
        d32[len32 * i - 1] |= _mask_lat;
        d32[len32 * i + 0] |= _mask_oe;
        d32[len32 * i + 1] |= (xe_tbl[i] & 1) ? (_mask_oe & ~0xFFFF) :  _mask_oe;
      }

      d32 += len32 * 7;

      {
      // SHIFTREG_ABCのY座標情報をセット;
        uint32_t poi = (~y) & ((panel_height >> 1) - 1);
        d32[poi                      ] = _mask_pin_a_clk | _mask_oe | _mask_pin_c_dat;
        d32[poi + (panel_height >> 1)] = _mask_pin_a_clk | _mask_oe | _mask_pin_c_dat;
        for (int i = 0; i < _dma_desc_set; ++i)
        { // 以前のY座標ビットを消去;
          poi = (poi + 1) & ((panel_height >> 1) - 1);
          d32[poi                      ] = _mask_pin_a_clk | _mask_oe;
          d32[poi + (panel_height >> 1)] = _mask_pin_a_clk | _mask_oe;
        }
        // 末尾にラッチを追加
        d32[panel_height - 1] |= _mask_lat | _mask_pin_b_lat;
      }

      // 作画中に次の割込みが発生した場合はビジー状態が続くことを回避するため処理をスキップする
      ulTaskNotifyTake( pdTRUE, 0);
    }
  }
//*/

//----------------------------------------------------------------------------
 }
}

#endif
#endif
